Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་ཡིད་ཀྱིས་ཚིགས་སུ་བཅད་པས་བཏང་བ། རི་ཡི་རྒྱལ་པོར་རྒྱལ་བ་མངོན་གནས་པར།
en: The Bhagavān knew the thoughts that were in the bodhisattva mahāsattva Maitreya’s mind, and from his own mind sent this verse to the bodhisattva mahāsattva Maitreya:

source: །མ་ཕམ་བདུད་རྣམས་ཕམ་བྱས་ཁྱོད་སོང་ཤིག །དེར་ནི་འགྲོ་བ་ཀུན་གྱི་དོན་ཆེན་ཡང་།
en: “Go, Ajita, you who have conquered the māras, To the king of mountains where jinas reside.

source: །བླ་ན་མེད་པ་མྱུར་དུ་གྲུབ་པར་འགྱུར།
en: There you will quickly accomplish A great unsurpassable benefit for beings.” {ii}

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡིད་ཀྱིས་ཚིགས་སུ་བཅད་པས་བཏང་བ་དང་། བཅོམ་ལྡན་འདས་ལ་ཡིད་ཀྱིས་ཕྱག་འཚལ། བཅོམ་ལྡན་འདས་ལ་ཡིད་ཀྱིས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འཁོར་དེ་ནས་བྱུང་སྟེ་སངས་རྒྱས་མུ་མེད་པ་རྒྱ་མཚོའི་བྱེ་མ་སྙེད་ཀྱི་གནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་མཆོད་རྟེན་ཆེན་པོ་གང་ན་ཡོད་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་ལྟ་སྟེ།
en: So the bodhisattva mahāsattva Maitreya, having received in his mind that verse from the Bhagavān, paid homage to the Bhagavān in his mind and, again in his mind, circumambulated him three times. He then left the assembly and went to Gṛdhrakūṭa, the king of mountains, which has been the residence of countless buddhas, as numerous as the grains of sand in the ocean, and where there is a great caitya.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པའི་ཕྱིར་དེའི་མོད་ལ་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་མཉམ་ཞིང་ཡངས་པ་རྒྱ་ཆེ་བ། སྡོང་དུམ་དང་ཚེར་མ་དང་རྡོ་དང་གསེག་མ་དང་གྱོ་མོ་མེད་ཅིང་ཁོ་ར་ཁོར་ཡུག་ཀུན་རིན་པོ་ཆེ་སྣ་བདུན་དུ་བྱིན་གྱིས་བརླབས་ཏེ།
en: The moment he arrived there, for the enjoyment of the Bhagavān, he magically transformed the king of mountains to become level and vast, without any tree stumps, thorns, stones, pebbles, or gravel, and with a surrounding wall made of the seven jewels.

source: ས་གཞི་རིན་པོ་ཆེ་ཨན་ད་རྙིལ་འབར་བ་བསམ་གྱིས་མི་ཁྱབ་ལ་དཔེ་མེད་པའི་ལྷའི་རྒྱན་ཐམས་ཅད་དང་རིན་པོ་ཆེས་བརྒྱན་པ། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་གྲངས་མེད་པ་དུ་མའི་བཀོད་པས་རབ་ཏུ་སྤྲས་པ། དགའ་ལྡན་རིས་ཀྱི་ལྷའི་ན་བཟས་ཁྱིམ་གྱི་ཉེ་འཁོར་བརྒྱན་ཅིང་སྤུད་དེ། བདུག་སྤོས་ཀྱི་སྣོད་སྣ་ཚོགས་ནས་ནི་བདུག་པ་འཐུལ་བར་བྱས། ཕྲེང་བ་དང་ལྡ་ལྡིས་ནི་བརྒྱན། མེ་ཏོག་སྣ་ཚོགས་ནི་བཀྲམ།
en: The ground was composed of countless shining sapphire jewels and was adorned by divine adornments and jewels, all of them beyond compare, and beautified by an array of innumerable, different kinds of jewels. All the area was decorated by the clothing of Tuṣita devas, pervaded by the aroma of incense from a variety of censers, adorned by garlands and wreaths, scattered with various flowers;

source: ལྷའི་རོལ་མོའི་སྒྲ་དབྱངས་ནི་བསྒྲགས། རྒྱལ་མཚན་དང་བ་དན་དང་ལྷབ་ལྷུབ་བསྒྲེང་བས་ནི་གང་། ཁྱམས་ཀྱི་དཀྱིལ་འཁོར་དུ་ནི་བླ་རེ་བྲེས།
en: it resounded with the sound of divine music, was filled with erect and fluttering banners and flags, and over it canopies were suspended.

source: འཁོར་གྱི་ཁྱམས་ཀྱི་དབུས་སུ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ལྷའི་སེང་གེའི་ཁྲི་མངོན་པར་སྤྲུལ་ཏེ་རྒྱུ་སྤུན་ལས་མ་བྱས་པའི་གོས་ནི་བཏིང་། ཀ་ཙ་ལིན་དི་ལྟར་འཇམ་ཞིང་རེག་ན་བདེ་བ་དགའ་ལྡན་རིས་ཀྱི་ལྷའི་ན་བཟས་ནི་གཡོགས།
en: In the center of this area a divine lion throne made from the seven jewels was emanated. It was draped in cloth that was not woven, and covered with divine clothing from Tuṣita that was as soft and pleasant to the touch as down.

source: སྟེང་དུ་སྙིང་པོ་བེག་ཚེར་ནི་བཏིང་། སྣམ་རྟེན་མཐའ་གཉིས་དམར་པོ་ནི་བཤམས།
en: A central awning hung above, and there were two red cushions placed upon it.

source: ཆུ་ཞེང་དང་འཕང་དུ་དཔག་ཚད་ཙམ་ཡོད་པ་བཙུགས་ཏེ།
en: It was a yojana wide and a yojana high.

source: ཞབས་རྟེན་ནི་ལྷ་དང་མིའི་ལས་འདས་པ། འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པ།
en: Its beautiful footstool, made of Jambu River gold, transcended that of humans and devas.

source: མུ་ཏིག་གི་དྲ་བས་གཡོགས་པ། རས་རིན་པོ་ཆེ་བཅོས་བུས་གཡོགས་པ།
en: It was covered with a net of strings of pearls, and it was draped in divine, precious cottons.

source: སེང་གེའི་ཁྲི་ལ་བཏགས་པའི་ལྷའི་རིན་པོ་ཆེའི་དྲིལ་བུ་ལས་ནི་སྒྲ་འཇམ་ཞིང་ཡིད་དུ་འོང་བ་གསལ་བར་འབྱུང་།
en: Strung upon the lion throne were strings of divine, precious bells from which came clear, beautiful, gentle sounds.

source: ཕྱོགས་ཀུན་དུ་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོས་སྣང་བར་གྱུར།
en: In all directions there were great shining jewels.

source: །རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་རྩ་བ་ནི་བཻ་དཱུརྱ་དྲི་མ་མེད་པའི་རིན་པོ་ཆེ་ཆེན་པོ་ལས་བྱས་པར་མངོན་པར་སྤྲུལ་ཏོ།
en: And there was emanated a precious, vast parasol, with a handle made of a great, precious jewel of stainless beryl.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ཁོ་ར་ཁོར་ཡུག་དང་བཅས་པ་ཐམས་ཅད་རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མའི་བཀོད་པའི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པས་བརྒྱན་པ་མངོན་པར་སྤྲུལ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་ཁྱིམ་དུ་ཞུགས་པར་གྱུར་ཏོ།
en: The bodhisattva mahāsattva Maitreya now emanated an inconceivable, adorning array of various jewels on Gṛdhrakūṭa, the king of mountains, and in its entire environs. Then, in an instant, he returned to the home of the youth Candraprabha.

source: །ཞུགས་ནས་བཅོམ་ལྡན་འདས་ལ་ཡིད་ཀྱིས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཡིད་ཀྱིས་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་སྟན་ལ་འདུག་གོ།
en: Once he was back there, in his mind he paid homage to the Bhagavān, and in his mind circumambulated him three times. He then sat on his seat.

source: རི་ཡང་ལྷ་རྫས་ཡངས་ཤིང་རྒྱ་ཆེ་བ།
en: He manifested the mountain as a divine, vast place

source: །རིན་ཆེན་རྡོ་སྟེངས་བཟང་ཞིང་དགའ་བ་དང་། །བསམ་གྱིས་མི་ཁྱབ་ལྷ་རྫས་ཡིད་ཀྱི་ཁྱམས།
en: With excellent, beautiful jewel flagstones— Inconceivable, divine, formed from the mind—

source: །དབུས་སུ་རིན་ཆེན་སེང་གེའི་ཁྲི་ཡང་བཙུགས།
en: And he placed in the center a precious lion throne. {iii} Jinaputra Ajita also manifested

source: །ལྷ་རྫས་གདུགས་ལས་ཡིད་འོང་སྒྲ་འབྱུང་ཞིང་།
en: A divine, splendid parasol that emitted delightful sounds

source: །ཕྱོགས་སུ་ནོར་བུ་རིན་ཆེན་འོད་ཆེར་འབྱུང་།
en: With great shining jewels all around,

source: །རྩ་བ་ཡིད་དུ་འཐད་པའི་བཻ་དཱུརྱ།
en: And a handle of pure, beautiful beryl. {iv}

source: །མ་ཕམ་རྒྱལ་བའི་སྲས་པོས་དེ་ལྟར་སྤྲུལ།
en: Maitreya, the hero, having emanated

source: །རི་ཡང་རིན་ཆེན་སྣ་ཚོགས་རྣམ་པར་བཀྲ།
en: A variety of jewels on the mountain,

source: །རིན་ཆེན་གདན་མཆོག་རྒྱང་གྲགས་ཚད་ཙམ་དུ། །བྱམས་པ་དཔའ་བོས་དེ་དག་རབ་སྤྲུལ་ནས།
en: And a precious seat that was a krośa in size,

source: །སྐད་ཅིག་དེ་ཉིད་ལ་ནི་ཁྱིམ་དུ་ཞུགས།
en: In one instant returned to the house. {v}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་ཆེན་པོ་རྒྱ་མཚོ་ལྟ་བུ་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན་ཏེ། ཡང་དག་པར་གཟེངས་བསྟོད།
en: Then the Bhagavān taught the Dharma to the great assembly that was like an ocean.

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས།
en: He inspired them, he filled them with joy, and he guided them.

source: ཡང་དག་པར་བཙུད་དེ་གདན་ལས་བཞེངས་ནས་གཤེགས་སོ།
en: Then he rose from his seat and departed.

source: །དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ཆུ་དྲོན་གྱི་སྒོར་བྱུང་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་གང་ན་ཡོད་པ་དེར་གཤེགས་ཏེ་བྱོན་པ་དང་བྱམས་པས་སྤྲུལ་པའི་ཁྱམས་གང་ན་ཡོད་པ་དེར་གཤེགས་ཏེ་བྱོན་ནས་བྱམས་པས་མངོན་པར་སྤྲུལ་པའི་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་བཞུགས་ཏེ།
en: And with the miraculous power of a buddha he emerged through Rājagṛha’s gate of the hot springs and proceeded toward Gṛdhrakūṭa, the king of mountains. When he arrived he went to the site created by Maitreya, and having arrived there he sat upon the great lion throne that Maitreya had manifested.

source: དགེ་སློང་གི་དགེ་འདུན་གྱིས་ནི་ཡོངས་སུ་བསྐོར་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་ནི་མདུན་གྱིས་བལྟས།
en: He was encircled by the assembly of bhikṣus, and the saṅgha of bodhisattvas gazed upon him from the front.

source: ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་དྲང་སྲོང་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་མི་དང་མི་མ་ཡིན་པས་ནི་ཕྱག་བྱས་ཏེ་འཁོར་རྒྱ་མཚོ་ལྟ་བུའི་ནང་ན་ཆོས་སྟོན་ཏོ།
en: The devas, nāgas, yakṣas, gandharvas, asuras, rishis, garuḍas, kinnaras, mahoragas, humans, and nonhumans paid homage to him. Within the ocean-like assembly, he taught the Dharma.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཐམས་ཅད་ལྷགས་པར་གྱུར་པ་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྲག་ཁྲིག་མང་པོ་དང་ལྷན་ཅིག་ཏུ་མེ་ཏོག་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་ཐོགས་ནས་རོལ་མོ་ནི་བྱེད།
en: Then the youth Candraprabha arrived together with a hundred thousand quintillion beings, and many millions of bodhisattva mahāsattvas who had come from other worlds. They were holding flowers, incense, and garlands; playing musical instruments and percussion;

source: ཕེག་ནི་རྡོབ། གདུགས་དང་རྒྱལ་མཚན་དང་ལྷའི་བ་དན་ནི་སྒྲེང་།
en: holding parasols, banners, and divine flags;

source: ཕྲེང་བ་ཆེན་པོ་དབུལ་བ་ནི་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཞི་བའི་སྒོ་ནས་བྱུང་སྟེ།
en: and holding great garlands as offerings. In order to make this offering to the Bhagavān they left the great city of Rājagṛha through the gateway of peace, and went to Gṛdhrakūṭa, to the Bhagavān.

source: བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་གང་ན་ཡོད་པ་དང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་མེ་ཏོག་དང་བདུག་པ་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དང་སིལ་སྙན་དང་ཕེག་རྡོབ་པས་མཆོད་པ་ཆེན་པོ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They bowed down their heads to the Bhagavān’s feet, circumambulated him three times, made a great offering to him of flowers, incense, perfume, garlands, ointments, powders, clothes, food, parasols, banners, and flags, playing music and percussion, and then they sat down in one place.

source: །གུས་པ་དང་ལྡན་རི་མོ་དང་ལྡན་པར་ཆོས་དྲི་བའི་ཕྱིར་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: In order to ask about the Dharma they sat in that place with veneration and with respect while the youth Candraprabha, kneeling on his right knee, with palms placed together, bowed toward the Bhagavān and said to him, “If the Bhagavān will give me an opportunity to seek answers to them, I have a few questions for the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་ཁྱོད་ལ་སྐབས་ཕྱེའི།
en: The Bhagavān addressed the youth Candraprabha, saying, “Young man, the Bhagavān will always give you the opportunity.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: Ask whatever question you wish to the Tathāgata, the arhat, the perfectly enlightened Buddha.”

source: གོ་སྐབས་ཕྱེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དུ་དང་ལྡན་ན་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར།
en: The Bhagavān having given him this opportunity, the young man Candraprabha asked, “Bhagavān, it is through possessing what qualities that bodhisattva mahāsattvas attain the samādhi, the revealed equality of the nature of all phenomena?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་པར་འགྱུར་རོ།
en: The Bhagavān replied to Candraprabha, “Young man, if bodhisattva mahāsattvas possess four qualities, they will attain the samādhi, the revealed equality of the nature of all phenomena.

source: །བཞི་གང་ཞེ་ན།
en: “What are those four qualities?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཤིང་འགྲོགས་ན་བདེ་བ་ཡིན།
en: Young man, one is that bodhisattva mahāsattvas are calm, and pleasant company.

source: དུལ་ཞིང་དུལ་བའི་ས་ཐོབ་པ་ཡིན་ཏེ། དེ་ཕ་རོལ་གྱིས་གཤེས་སམ། སྤྱོས་པའི་ཚིག་ཉེས་པར་སྨྲ་ཞིང་། ཉེས་པར་རྗོད་པའི་ཚིག་གི་ལམ་བཟོད་ཅིང་མི་མཇེད་པའི་རང་བཞིན་ཅན་ཡིན།
en: They have self-restraint, and have attained a level of self-restraint such that when others abuse them or insult them, they will be patient with the abuse and the insults that are spoken, for it is their nature to have endurance;

source: ལས་ལ་ལྟ་ཞིང་ང་རྒྱལ་བཅོམ་པ་དང་ཆོས་འདོད་པ་ཡིན་ཏེ།
en: they have the view of karma, have overcome pride, and their desire is for the Dharma.

source: གཞོན་ནུ་ཆོས་དང་པོ་འདི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་རོ།
en: Young man, if bodhisattva mahāsattvas have this first quality, they will attain this samādhi.

source: །གཞན་ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན།
en: “Another, young man, is that bodhisattva mahāsattvas have correct conduct.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་ཅིང་ཚུལ་ཁྲིམས་མ་ཞིག་པ་དང་ཚུལ་ཁྲིམས་ལ་སྐྱོན་མེད་པ་དང་ཚུལ་ཁྲིམས་འདྲེན་མ་མ་ཡིན་པ་དང་ཚུལ་ཁྲིམས་སྲ་སྲེར་མ་གྱུར་པ་དང་ཚུལ་ཁྲིམས་མ་ཉམས་པ་དང་ཚུལ་ཁྲིམས་མི་གནས་པ་དང་ཚུལ་ཁྲིམས་མ་འབགས་པ་དང་ཚུལ་ཁྲིམས་མི་དམིགས་པ་དང་འཕགས་པས་བསྟོད་པའི་ཚུལ་ཁྲིམས་དང་མཁས་པས་བསྟོད་པའི་ཚུལ་ཁྲིམས་པ་ཡིན་ཏེ།
en: They have pure conduct, conduct that is not impaired, conduct that is free of faults, conduct that is unshakable, conduct that is unstained, conduct that has not declined, conduct that is unattached, conduct that is inviolate, conduct that is beyond conceptualization, conduct that is praised by the āryas, and conduct that is praised by the wise.

source: གཞོན་ནུ་ཆོས་གཉིས་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་རོ།
en: Young man, if bodhisattva mahāsattvas have these two qualities, they will attain this samādhi.

source: །གཞན་ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁམས་གསུམ་ལ་སེམས་སྐྲག་པ་དང་སེམས་དངངས་པ་དང་སེམས་སྐྱོ་བ་དང་དོན་དུ་མི་གཉེར་ཅིང་མངོན་པར་མི་དགའ་བ་དང་མ་ཆགས་མ་ཞེན་པ་དང་ཁམས་གསུམ་ལ་ཡིད་སྐྱོ་བས་ཁམས་གསུམ་ལས་གཞན་དུ་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཐར་བར་བྱའོ་ཞེས་བརྩོན་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་སྒྲུབ་པ་ཡིན་ཏེ།
en: “Another, young man, is that bodhisattva mahāsattvas are frightened of the three realms. They are terrified of them, saddened by them, do not value them, take no delight in them, and have no attachment or clinging to them. Because they are distressed by the three realms they are dedicated to the thought, ‘I shall deliver other beings from their suffering, to somewhere other than the three realms!’ and they thus proceed to the highest, complete enlightenment of perfect buddhahood.

source: གཞོན་ནུ་ཆོས་གསུམ་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་རོ།
en: Young man, bodhisattva mahāsattvas who have these three qualities will attain this samādhi.

source: །གཞན་ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དད་ཅིང་ཆོས་ཡོངས་སུ་ཚོལ་བས་མི་ངོམས་པ་ཡིན།
en: “Moreover, young man, bodhisattva mahāsattvas have faith. They insatiably seek the Dharma.

source: མང་དུ་ཐོས་ཤིང་འཇིགས་པ་མེད་པ་ཡིན།
en: They listen to many teachings. They have confidence.

source: ཆོས་འདོད་ཅིང་ཆོས་ལྷུར་བྱེད་པ་ཡིན་ཏེ།
en: They long for the Dharma. They are devoted to the Dharma.

source: རྙེད་པ་དང་བཀུར་སྟི་ལྷུར་བྱེད་པ་མ་ཡིན།
en: They are not devoted to obtaining material gain or honors.

source: ཤེས་ཀྱི་ཁེ་ལྷུར་བྱེད་པ་མ་ཡིན།
en: They are not devoted to attaining success through knowledge.

source: ཕན་པའི་དངོས་པོ་སྔོན་དུ་འགྲོ་བའི་སེམས་ཀྱིས་ཆོས་ཇི་སྐད་དུ་ཐོས་པ་དང་། ཇི་ལྟར་ཁོང་དུ་ཆུད་པ་གཞན་ལ་རྒྱ་ཆེར་འཆད་ཅིང་རབ་ཏུ་སྟོན་པ་ཡིན་ཏེ།
en: They think first of what will benefit others, and they teach and explain extensively to others the Dharma that they have received.

source: ཤེས་ཀྱི་ཁེ་འདོད་པས་ནི་མ་ཡིན་གྱི་ཅི་ནས་སེམས་ཅན་འདི་རྣམས་ཆོས་འདི་དག་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་སྙམ་པ་སྟེ། གཞོན་ནུ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་རོ།
en: They have no desire for material gain through their reputation. They think, ‘If these beings can hear this Dharma then they will proceed irreversibly to the highest, complete enlightenment of perfect buddhahood.’ Young man, bodhisattva mahāsattvas who have these four qualities will attain this samādhi.

source: །གཞོན་ནུ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་ཏེ། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: “Young man, bodhisattva mahāsattvas who have these four qualities will attain the samādhi, the revealed equality of the nature of all phenomena, and they will quickly attain the highest, complete enlightenment of perfect buddhahood.

source: །གཞོན་ནུ་རྣམ་གྲངས་འདིས་ཏིང་ངེ་འཛིན་འདི་འདི་ལྟར་སངས་རྒྱས་མང་པོས་བཤད་པ་སངས་རྒྱས་མང་པོས་བསྔགས་པ་སངས་རྒྱས་མང་པོས་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ། སངས་རྒྱས་མང་པོས་རབ་ཏུ་བསྟོད་པ་ཡིན་ཏེ།
en: “Young man, the samādhi has been taught through this Dharma discourse by many buddhas, has been commended by many buddhas, has been explained by many buddhas, and has been praised by many buddhas.

source: གཞོན་ནུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མང་པོའི་དྲུང་དུ་ང་རབ་ཏུ་བྱུང་ནས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་རྒྱ་ཆེར་མཉན་ཏེ་བཟུང་ངོ་།
en: “Young man, I have entered homelessness in the presence of many buddha bhagavāns. I heard extensively from them this samādhi, the revealed equality of the nature of all phenomena.

source: །དྲིས་ཤིང་བཅངས་སོ། །བཀླགས་སོ། །བཏོན་ཏོ། །ཉོན་མོངས་པ་མེད་པའི་བསྒོམ་པས་བསྒོམས་ཤིང་མང་དུ་བྱས་སོ། །གཞན་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: I obtained it, asked questions about it, preserved it, recited it to others, promoted it, meditated on it with unadulterated meditation, promulgated it, and made it widely known to others.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་མང་པོ་ངེས་པར་བརྗོད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྔོན་བྱུང་བའི་གཏམ་བསྟན་པ་འདི་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ།
en: Thereupon the Bhagavān taught extensively in verse what he had previously said about the samādhi doorway taught by many buddhas.

source: དྲན་པ་བསྐལ་པ་གཞལ་མེད་དཔག་ཡས་ན།
en: “I remember countless, innumerable eons ago

source: །རྒྱལ་བ་དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་བྱུང་སྟེ།
en: There was a jina named Svarāṅgaghoṣa.

source: །བདེ་གཤེགས་དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་དེ་ཡི།
en: Tathāgata Svarāṅgaghoṣa

source: །ཚེ་ཚད་ལོ་ཡང་བརྒྱ་ཕྲག་དྲུག་ཅུར་གྱུར།
en: Had a lifespan of six thousand years. {1}

source: །དེ་ཡི་ཕ་རོལ་སངས་རྒྱས་གཞན་བྱུང་བ།
en: “After him there was a buddha,

source: །མི་མཆོག་མཚན་ནི་ཡེ་ཤེས་དབང་ཕྱུག་སྟེ།
en: A supreme man named Jñāneśvara.

source: །རྐང་གཉིས་གཙོ་བོ་ཡེ་ཤེས་དབང་ཕྱུག་གི།
en: Jñāneśvara, highest of humans,

source: །ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གཉིས་སོ།
en: Had a lifespan of twelve thousand years. {2}

source: །ཡེ་ཤེས་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Jñāneśvara there was a buddha,

source: །གཟི་བརྗིད་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Tejeśvara.

source: །རྐང་གཉིས་གཙོ་བོ་གཟི་བརྗིད་དབང་ཕྱུག་གི།
en: Tejeśvara, highest of humans,

source: །ཚེ་ཚད་ལོ་ནི་སྟོང་ཕྲག་དྲུག་ཅུ་བདུན།
en: Had a lifespan of sixty-seven thousand years. {3}

source: །གཟི་བརྗིད་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Tejeśvara there was a buddha,

source: །བློ་གྲོས་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Matīśvara.

source: །རྐང་གཉིས་གཙོ་བོ་བློ་གྲོས་དབང་ཕྱུག་གི།
en: Matīśvara, highest of humans,

source: །ཚེ་ཡི་ཚད་ནི་ལོ་གྲངས་བྱེ་བར་ཚང་།
en: Had a lifespan of ten million years. {4}

source: །བློ་གྲོས་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Matīśvara there was a buddha,

source: །ཚངས་པའི་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Brahmeśvara.

source: །རྐང་གཉིས་གཙོ་བོ་ཚངས་པའི་དབང་ཕྱུག་གི།
en: Brahmeśvara, highest of humans,

source: །ཚེ་ཡི་ཚད་ནི་ལོ་ཁྲི་བཞི་སྟོང་གྱུར།
en: Had a lifespan of fourteen thousand years. {5}

source: །ཚངས་པའི་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Brahmeśvara there was a buddha,

source: །མི་ཡི་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Agnīśvara.

source: །རྐང་གཉིས་གཙོ་བོ་མི་ཡི་དབང་ཕྱུག་གི།
en: Agnīśvara, highest of humans,

source: །ཚེ་ཚད་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་གྱུར།
en: Had a lifespan of seventy-six thousand years. {6}

source: །མི་ཡི་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Agnīśvara there was a buddha,

source: །ཚངས་པའི་ཞལ་ཞེས་བྱ་བ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Brahmānana.

source: །རྐང་གཉིས་གཙོ་བོ་ཚངས་པའི་ཞལ་དེ་ཡི།
en: Brahmānana, highest of humans,

source: །ཚེ་ཡི་ཚད་ནི་ཉིན་ཞག་བདུན་དུ་གྱུར། །ཚངས་པའི་ཞལ་གྱི་ཕ་རོལ་སངས་རྒྱས་ནི།
en: Had a lifespan of seven days. {7} “After Brahmānana there was a buddha,

source: །ཚོགས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Gaṇeśvara.

source: །རྐང་གཉིས་གཙོ་བོ་ཚོགས་ཀྱི་དབང་ཕྱུག་གི།
en: Gaṇeśvara, highest of humans,

source: །ཚོགས་ཀྱི་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Gaṇeśvara there was a buddha,

source: །དབྱངས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Ghoṣeśvara.

source: །རྐང་གཉིས་གཙོ་བོ་དབྱངས་ཀྱི་དབང་ཕྱུག་གི།
en: Ghoṣeśvara, highest of humans,

source: །ཚེ་ཚད་ལོ་གྲངས་བྱེ་བ་ཕྲག་དགུར་ཚང་།
en: Had a lifespan of ninety million years. {9}

source: །དབྱངས་ཀྱི་དབང་ཕྱུག་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Ghoṣeśvara there was a buddha,

source: །དབྱངས་ཀྱི་ཞལ་ཞེས་བྱ་བ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Ghoṣānana.

source: །རྐང་གཉིས་གཙོ་བོ་དབྱངས་ཀྱི་ཞལ་གྱི་ཡང་།
en: Ghoṣānana, highest of humans,

source: །ཚེ་ཚད་ལོ་གྲངས་བྱེ་བ་ཕྲག་བཅུར་ཚང་།
en: Had a lifespan of a hundred million years. {10}

source: །དབྱངས་ཀྱི་ཞལ་གྱི་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Ghoṣānana there was a buddha,

source: །ཟླ་བའི་ཞལ་ཞེས་བྱ་བ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Candrānana.

source: །རྐང་གཉིས་གཙོ་བོ་ཟླ་བའི་ཞལ་གྱི་ནི།
en: Candrānana, highest of humans,

source: །ཚེ་ཡི་ཚད་ཀྱང་ཉིན་ཞག་གཅིག་ཏུ་གྱུར།
en: Had a lifespan of one day. {11}

source: །ཟླ་བའི་ཞལ་གྱི་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Candrānana there was a buddha,

source: །ཉི་མའི་ཞལ་ཞེས་བྱ་བ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Sūryānana.

source: །རྐང་གཉིས་གཙོ་བོ་ཉི་མའི་ཞལ་གྱི་ཡང་།
en: Sūryānana, highest of humans,

source: །ཚེ་ཚད་ལོ་ནི་སྟོང་ཕྲག་བཅྭ་བརྒྱད་དོ།
en: Had a lifespan of eighteen thousand years. {12}

source: །ཉི་མའི་ཞལ་གྱི་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Sūryānana there was a buddha,

source: །ཚངས་པའི་ཞལ་ཞེས་བྱ་བའི་རྒྱལ་བ་བྱུང་།
en: Another jina who was named Brahmānana.

source: །རྐང་གཉིས་གཙོ་བོ་ཚངས་པའི་ཞལ་གྱི་ཡང་།
en: Brahmānana, highest of humans, [DP.138]

source: །ཚེ་ཚད་ལོ་ནི་སྟོང་ཕྲག་ཉི་ཤུའོ།
en: Had a lifespan of twenty thousand years. {13}

source: །ཚངས་པའི་ཞལ་གྱི་ཕ་རོལ་སངས་རྒྱས་ནི།
en: “After Brahmānana there was a buddha,

source: །ཚངས་པའི་སྙན་པ་ཞེས་བྱ་རྒྱལ་བ་བྱུང་།
en: A jina who was named Brahmaśrava.

source: །རྐང་གཉིས་གཙོ་བོ་ཚངས་པའི་སྙན་པ་ཡི།
en: Brahmaśrava, highest of humans,

source: །ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་བརྒྱད་གྱུར།
en: Had a lifespan of eighteen thousand years. {14}

source: །བསྐལ་པ་གཅིག་ལ་སངས་རྒྱས་འདི་དག་དང་། །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་ཉིས་བརྒྱ་བྱུང་། །ཟིལ་གྱིས་མ་ནོན་དེ་བཞིན་གཤེགས་པ་ཡི།
en: “In one eon these buddhas appeared Among two hundred guides of the world.

source: །མཚན་རྣམས་འདིར་ཡང་བརྗོད་ཀྱིས་མཉན་པར་གྱིས།
en: Listen as I shall proclaim the names Of these invincible tathāgatas: {15}

source: །མཐའ་ཡས་དབྱངས་དང་རྣམ་པར་གྲགས་པའི་དབྱངས།
en: “Anantaghoṣa and Vighuṣṭaghoṣa,

source: །རྣམ་པར་བསྒྲགས་པའི་གཟི་བརྗིད་རྣམ་གྲགས་སྒྲ།
en: Vighuṣṭatejas and Vighuṣṭaśabda,

source: །སྒྲ་སྐད་རྣམ་གྲགས་སྒྲ་དབྱངས་མཆོད་པ་དང་། །དབྱངས་ཀྱི་ཡན་ལག་དཔའ་དང་དབྱངས་དག་དང་། །ཡེ་ཤེས་སྟོབས་དང་ཡེ་ཤེས་བྱེ་བྲག་འགྲོ།
en: Svarāvighuṣṭa and Svarārcita, Svarāṅgaśūra and Svarāṅgaśabda, {16} “Jñānābala and Jñānaviśeṣaga,

source: །ཟིལ་གྱིས་མ་ནོན་ཡེ་ཤེས་ཡང་དག་འཕགས།
en: Jñānābhibhū and Jñānasamudgata,

source: །ཡེ་ཤེས་འོད་འཕྲོ་ཡེ་ཤེས་མངོན་པར་འཕགས།
en: Jñānārcimat and Jñānābhyudgata,

source: །ཡེ་ཤེས་རྣམ་གྲགས་དེ་བཞིན་ཡེ་ཤེས་དཔའ།
en: Vighuṣṭajñāna and likewise Jñānaśūra, {17}
